Revit 2027 API
Parameter.Set(ElementId) Method
Sets the parameter to a new element id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Set(
	ElementId value
)
Public Function Set (
	value As ElementId
) As Boolean
public:
bool Set(
	ElementId^ value
)
member Set :
        value : ElementId -> bool
Parameters
value ElementId
The new element id to which the parameter is to be set.
Return Value
Boolean
The Set method will return True if the parameter was successfully set to the new value, otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | The parameter is read-only.
Remarks
You should only use this method if the StorageType property reports the type of the parameter as an ElementId.
See Also
Reference
Parameter Class
Set Overload
Autodesk.Revit.DB Namespace